Revit 2024 API
AreaReinforcementType Class
 An object that specifies the type of a Structural Area Reinforcement element in Autodesk Revit.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class AreaReinforcementType : ElementType
Visual Basic
Public Class AreaReinforcementType _
	Inherits ElementType
Visual C++
public ref class AreaReinforcementType : public ElementType
Remarks
 The clear cover settings can be accessed via this object.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Structure.AreaReinforcementType
See Also
AreaReinforcementType Members
Autodesk.Revit.DB.Structure Namespace